Revit 2026 API

# ExporterIFCUtilsUsesInstanceGeometry Method

---

Identifies if the family instance has its own geometry, or uses the symbol's geometry with a transform.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool UsesInstanceGeometry(
	FamilyInstance familyInstance
)
```
```vb
Public Shared Function UsesInstanceGeometry (
	familyInstance As FamilyInstance
) As Boolean
```
```cpp
public:
static bool UsesInstanceGeometry(
	FamilyInstance^ familyInstance
)
```
```fsharp
static member UsesInstanceGeometry :
        familyInstance : FamilyInstance -> bool
```

#### Parameters

familyInstance FamilyInstance
     The family instance.

#### Return Value

Boolean True if the instance has its own geometry. False if the symbol's geometry is used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A Family Instance can have its own copy of geometry, or use the symbol's geometry with a transform. This method identifies the source of this family instance's geometry.

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace